# Задача 1
# Напишіть програму, яка запитує у користувача суму в одній валюті (наприклад, долари)
# та конвертує її в іншу валюту (наприклад, євро), використовуючи поточний курс обміну.
# Якщо користувач вибирає USD, конвертувати в EUR; якщо вибирає EUR, конвертувати в USD.
usd_to_eur_rate = 0.89
eur_to_usd_rate = 1.11

amount = float(input("Введіть суму для конвертації: "))
currency = input("Оберіть валюту (USD або EUR): ").upper()

if currency == "USD":
    converted_amount = amount * usd_to_eur_rate
    print(f'Total in EUR is {converted_amount}')
elif currency == "EUR":
    converted_amount = amount * eur_to_usd_rate
    print(f'Total in USD is {converted_amount}')
else:
    print("Невірно вибрана валюта. Оберіть USD або EUR.")

# Задача 2.
# Напишіть програму, яка приймає температуру в градусах Цельсія і
# виводить повідомлення про стан води (рідка, тверда, газоподібна) в залежності від введеної температури.


# Задача 3.
# Напишіть програму, яка приймає масу тіла і його швидкість, та визначає його кінетичну енергію.
# Потім виведіть повідомлення про ступінь руху об'єкта (спокій, повільний рух, швидкий рух) за допомогою умовної конструкції.
