# Задача 1
# Створіть кортеж рядків і виведіть перший та останній елементи. Виведіть їх за допомогою функції print на екран.
tuple_example = (3, 5, 3, 6, 7, 9)
print(tuple_example[0])
print(tuple_example[-1])
# Задача 2
# Створіть кортеж і пройдіться по його елементах за допомогою циклу.
# Виведіть кожен елемент на екран за допомоги функції print.
for i in tuple_example:
    print(i)
# Задача 3
# Знайдіть мінімальне та максимальне значення в кортежі чисел. Виведіть результат за допомогою функції print.
print(min(tuple_example))
print(max(tuple_example))
