# Створіть програму, яка перебирає список чисел. Використовуючи умовний оператор, використайте команду continue,
# щоб пропустити обробку чисел, які менше за 0. Використайте команду pass для ігнорування чисел, які рівні 0

numbers = [10, -5, 0, 15, -3, 7, 0, -8]

for num in numbers:
    if num < 0:
        continue
    elif num == 0:
        pass
    print(num)

# Створіть програму, яка шукає перше число в списку, яке ділиться на 7 без остачі.
# Використовуйте цикл for та команду break, щоб зупинити перебір елементів після знаходження першого числа.

numbers = [23, 56, 14, 35, 70, 42]

for num in numbers:
    if num % 7 == 0:
        print(f'first number: {num}')
        break
else:
    print("There are no numbers")

# Напишіть програму, яка використовує цикл for для перебору списку чисел.
# Пропустіть операції з числами, які дорівнюють 0 або менше. Виведіть суму всіх інших чисел.

numbers = [10, -5, 0, 15, -3, 7, 0, -8]

total_sum = 0

for num in numbers:
    if num > 0:
        total_sum += num

print(f'Total sum of number greater than 0: {total_sum}')
