# Задача 1
# Лічильник до 10: Напишіть програму, яка використовує цикл while для виведення чисел від 1 до 10.
# i = 1
# while i < 11:
#     print(i)
#     i += 1
# Задача 2
# Сума чисел: Напишіть програму, яка використовує цикл while для підрахунку суми чисел від 1 до 100.
# count = 0
# i = 1
# while i < 101:
#     count += i
#     i += 1
# print(count)
# Задача 3
# Зворотний відлік: Напишіть програму, яка використовує цикл while для виведення зворотного відліку від 10 до 1,
# після чого виводить "Старт!"
count = 10
while 0 < count:
    print(count)
    count -= 1
print('Старт!')
