# Задача 1
# Напишіть програму, що створює словник для конвертації валют,
# де ключами є валютні коди (наприклад, USD, EUR), а значеннями - курс обміну

dict_currency_sell = {'USD': 39.7, 'EUR': 42.8, 'PLN': 9.8}
dict_currency_buy = {'USD': 39.85, 'EUR': 42.95, 'PLN': 9.95}

# Уявімо, що ми маємо список предметів, і нам потрібно створити словник, де кожен предмет буде ключем,
# а початкове значення для кожного ключа буде встановлене як певна оцінка (наприклад, 0).

subjects_dict = dict.fromkeys(['Math', 'English', 'Chemistry', 'Biology', 'History'], '100')
print(subjects_dict)

# Задача 3
# Напишіть програму для створення словника, де ключами будуть імена студентів, а значеннями - їхні середні бали

students_grades = {
    'Jordan': 85,
    'Eastwood': 90,
    'Potter': 76,
    'Musk': 88,
    'Mateus': 99
}

# Виведення словника з іменами та середніми балами студентів
print("List of students grades:", students_grades)
