# Задача 1
# Напишіть програму на Python, яка виводить таблицю множення від 1 до 10 за допомогою вкладених циклів.
for i in range(2, 10):
    print(f'=={i}==')
    for j in range(2, 10):
        print(f'{i}*{j}={i * j}')

# Задача 2
# Створіть програму, яка приймає список чисел зроблений за допомогою range.
# Виведіть кожне число, зведене в квадрат, за допомогою вкладеного циклу.
numbers = list(range(1, 11))
for i in numbers:
    print(i ** 2)
# Задача 3
# Напишіть програму, яка обчислює суму всіх чисел від 1 до 100 за допомогою циклу та функції range()
total_sum = 0
for i in range(1, 101):
    total_sum += i
print(total_sum)
