# Задача 1
# Створіть змінну з текстом  і виведіть її на екран за допомогою функції print.
text = 'Hello World'
print(text)
# Задача 2
# Створіть ще одну змінну але вже з числом  і виведіть її на екран за допомогою функції print.
number_a = 42
# Задача 3
# Виведіть на екран за допомогою функцій type та print тип двох змінних з задачі один та задачі два.

print(type(text))
print(type(number_a))
