# Задача 1
# Напишіть програму, яка виводить на екран повідомлення про температуру зараз,
# якщо відомо місце проживання і температура у градусах Цельсія.
# Виведіть це у форматі "У місті [місце] зараз [температура] градусів Цельсія".
temperture = input("Enter temperature in Celsius: ")
city = input("Enter city name: ")
print(f'In {city} now {temperture} degrees Celsius')
# Задача 2
# Напишіть програму, яка приймає від користувача три рядки: ім'я, вік і місце проживання. Виведіть ці дані у вигляді:
# Ім'я: [ім'я користувача]
# Вік: [вік користувача] років
# Місце проживання: [місце проживання користувача]
# Задача 3
name = input("Enter your name: ")
age = input("Enter your age: ")
town = input("Enter your town: ")
print(f'Name: {name}, Age: {age}, Town: {town}\n')
# Напишіть програму, яка приймає від користувача довжину сторін прямокутника та обчислює його периметр і площу.
# Виведіть результат у такому форматі:
# Довжина: [довжина сторони]
# Ширина: [ширина сторони]
# Периметр: [значення периметра]
# Площа: [значення площі]
