# Задача 1:
# Створіть програму, яка запитує у користувача його вік. Якщо вік користувача менше 18 років, програма повинна вивести
# "Ви ще надто молоді", якщо вік рівний або більше 18 років, то повинна вивести "Ласкаво просимо!".
age = int(input("Ваш вік? "))
if age >= 18:
    print("Ласкаво просимо!")
else:
    print("Ви ще надто молоді")
# Задача 2:
# Напишіть програму, яка порівнює дві змінні: temperature_outside та temperature_comfort.
# Якщо temperature_outside вище temperature_comfort, виведіть "Увімкніть кондиціонер".
# Якщо нижче, виведіть "Можливо, вам буде комфортно без кондиціонера".
temperature_outside = int(input("Яка температура?"))
temperature_comfort = int(input("Яка температура?"))
if temperature_outside > temperature_comfort:
    print('Увімкніть кондиціонер')
elif temperature_outside < temperature_comfort:
    print("Увімкніть кондиціонер")

# Задача 3:
# напишіть студентські тести по математиці де ви даєте приклад і користувач вводе відповідь,
# а ви йому відповідаєте вірно він вирішив задачу чи ні. Зробіть 3-5 прикладів.

user_answer = int(input("Скільки буде 40 + 2: "))
if user_answer == 42:
    print('Вірно!')
else:
    print('Не вірно!')