# Задача з уроку:
# Користувач дає вам список (тобто в програмі у вас буде змінна зі списком оцінок), наприклад:
class_marks = [11, 10, 11, 10, 8]
# # Вам потрібно вирахувати середню оцінку в групі.
print(sum(class_marks) // len(class_marks))
# # Задача 2:
# # Попросіть користувача ввести рядок з 4 словами, збережіть це у список, видаліть два останні елементи.
# # І додайте в кінець один елемент з вашим іменем.
text = input('Enter a string: ')
list_of_words = text.split(' ')
list_of_words.pop()
list_of_words.pop()
print(list_of_words)
# Задача 3:
# Попросіть користувача ввести рядок зі словами, підрахуйте кількість цих слів і виведіть користувачу, скільки слів він ввів.
text_b = input('Enter a string: ')
list_of_words_b = text_b.split(' ')
print(len(list_of_words_b))
