# Задача 1
# Створіть список з довільних чисел і виведіть його елементи, починаючи з другого елементу та з кроком 2.
some_list = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print(some_list[1::2])

# Задача 2
# Створіть рядок зі слів "Python is awesome!" і виведіть тільки слово "awesome" у верхньому регістрі з використанням зрізу.
# Задача 3
my_str = "Python is awesome!"
print(my_str[10::].upper())
# Перевірка на паліндром
# (Паліндром - це слово, яке читається однаково зліва направо та справа наліво, наприклад, "радар" чи "кайак".)
# Напишіть програму яка приймає слово у користувача та за допомогою зріза, перевірте, чи є цей рядок паліндромом.
# Використовуйте assert для перевірки результату:
# якщо рядок є паліндромом, то assert має пройти; якщо ні, має бути виведено відповідне повідомлення про помилку.
palindrome = 'radarl'
assert palindrome == palindrome[::-1], "Not a palindrome"
