# Задача 1
# Напишіть програму, яка приймає рядок від користувача і виводить його у верхньому регістрі.
a = input('Enter your first name: ')
print(a.upper())
# Задача 2
# Створіть програму, яка приймає рядок від користувача та заміняє всі входження символу 'a' на '*',
# якщо символ ‘а’ відсутній до відповідне повідомлення.
b = input('Enter your word: ')
print(b.replace('a', '*',))
# Задача 3
# Напишіть програму, яка приймає рядок від користувача та виводить його з позначенням кількості символів у ньому.
c = input('Enter your word: ')
print(f'Кількість символів у введеному тексті: {len(c)}')
